import Layout from "../../components/Layout";

export default () => (
  <Layout>
    {/* Title 
      مستندات ورود به حساب کاربری با استفاده از نرم‌افزار دسکتاپ لیارا
    */}

    {/* Heading
      نرم‌افزار دسکتاپ لیارا
    */}

    {/* Videos
    https://files.liara.ir/docs/desktop/login-with-liara-desktop.gif
    */}

    {/* Description
     پس از نصب و اجرای نرم‌افزار دسکتاپ لیارا، روی دکمه‌ی ورود با مرورگر کلیک
      کنید. در این صفحه‌ی جدید می‌توانید با کلیک روی دکمه‌ی افزودن حساب کاربری،
      حساب‌های خودتان را اضافه کرده و یا درصورتی که حساب‌های شما به‌صورت خودکار
      تشخیص داده شده بود می‌توانید روی دکمه‌ی ارسال اطلاعات به اپلیکیشن دسکتاپ
      کلیک کنید.
     */}
  </Layout>
);
