import Layout from "../../components/Layout";
import ZoomableImage from "../../components/ZoomableImage";
import Head from "next/head";
import Notice from "../../components/Notice";

export default () => (
  <Layout>
    <Head>
      <title>سرویس ابری لیارا | مستندات متغیرها - Environment Variables</title>
    </Head>

    <h1>متغیرهای محیطی</h1>
    <span className="pageDescription">(Environment Variables)</span>

    <p>
      هر برنامه‌ای ممکن است در محیط‌های مختلفی اجرا شود. برای مثال برنامه‌ی شما
      علاوه بر این که در حالت development روی کامپیوتر شما اجرا می‌شود، روی
      سرورهای لیارا هم قرار گرفته و در حالت production به اجرا در می‌آید. یک
      برنامه‌ی open-source ممکن است در صدها محیط مختلف توسط افراد مختلف اجرا
      شود.
    </p>

    <p>
      اگر چه که همه‌ی این محیط‌ها یک برنامه را اجرا می‌کنند، اما معمولا هر کدام
      از آن‌ها دارای متغیرهایی برای کانفیگ برنامه در آن محیط هستند. برای نمونه،
      برنامه‌ی شما در کامپیوتر‌تان ممکن است به دیتابیس لوکال‌تان متصل شود اما
      روی سرورهای لیارا، انتظار دارید که به دیتابیس اصلی‌تان متصل شود.
    </p>

    <p>
      یکی از بهترین روش‌ها برای پیکربندی برنامه‌ها برای هر محیط، استفاده از
      Environment Variables ها است.
      <br />
      ممکن است برنامه‌ی شما دارای یک فایل
      <span className="code">.env</span>
      جهت ذخیره‌ی متغیرها باشد، اما در لیارا نیازی به این فایل نیست و از بخش
      تنظیمات هر برنامه می‌توانید متغیرهای موردنظرتان را تعریف کنید. (اگرچه
      میتوانید با آپلود فایل<span className="code">.env</span> برنامه‌ی‌تان همه‌ی
      ENV ها را به لیارا منتقل کنید.)
    </p>

    <h3>دسترسی به متغیرها</h3>
    <p>
      با مراجعه به فهرست «برنامه‌ها»، روی برنامه‌ی مورد نظرتان کلیک کنید.
      <br />
      سپس روی گزینه‌ی تنظیمات از فهرست سمت راست کلیک کنید تا وارد صفحه‌ی تنظیمات
      شوید.
      <br />
      در این صفحه، بخش متغیرها را می‌توانید مشاهده کنید.
    </p>
    <ZoomableImage src="/static/envs-empty.png" alt="بخش متغیرها" />
    <p>
      با کلیک بر روی گزینه‌ی <b>افزودن متغیر جدید</b> یک سطر جدید با دو فیلد
      <span className="code">Key</span>و<span className="code">Value</span>
      ایجاد می‌شود که می‌توانید متغیر مد نظرتان را از طریق آنها تعریف نمایید.
    </p>
    <ZoomableImage src="/static/envs-full.png" alt="نمونه‌ای از متغیرها" />
    <br />
    <Notice variant="info">
      اگر از سرویس دیتابیس های لیارا استفاده کرده‌ باشید، برای وارد کردن ENV های
      مربوط به آن دیتابیس میتوانید از طریق بخش <b>ENV های آماده</b> به سرعت اون
      ها رو به برنامه‌ی‌تان اضافه کنید:
      <br />
      <br />
      <ZoomableImage src="/static/env-auto.png" alt="ورود خودکار env ها" />
    </Notice>
  </Layout>
);
