import Layout from "../../components/Layout";
import ZoomableImage from "../../components/ZoomableImage";
import Head from "next/head";
import Notice from "../../components/Notice";

export default () => (
  <Layout>
    <Head>
      <title>مستندات آی‌پی ثابت Fixed - Static IP - لیارا</title>
    </Head>

    <h1>آی‌پی ثابت</h1>
    <span className="page-description">(Fixed / Static IP)</span>

    <p>
      زمانی که یک برنامه جدید در لیارا ایجاد می‌کنیم، به صورت پیش‌فرض، آی‌پی
      برنامه ما متغیر خواهد بود و ممکن است به صورت دوره‌ای این IP تغییر کند. از
      عمده دلایل این کار، افزایش سرعت، بهینه‌سازی و و بهبود مصرف منابع هست و این
      کار، هیچ مشکلی در برنامه شما، ایجاد نخواهد کرد.
    </p>

    <h2>فعال‌کردن آی‌پی ثابت</h2>
    <p>
      لیارا این امکان را برای ما فراهم کرده که در برنامه خود از آی‌پی ثابت
      اشتراکی نیز برخوردار باشیم. برای اینکه تمام درخواست‌های خروجی برنامه با یک
      IP ثابت صورت بگیرد. شما باید وارد قسمت <b>تنظیمات</b> برنامه خود شده و
      گزینه <b>فعال‌کردن آی‌پی ثابت</b> را روشن کنید.
    </p>
    <ZoomableImage src="https://files.liara.ir/liara/docs/enabled-static-ip.png" />
    <p>
      پس از انجام این کار، یک IP ثابت به برنامه شما تعلق می‌گیرد که در بخش{" "}
      <b>اطلاعات کلی</b> نیز، می‌توانید آن را مشاهده بفرمایید:
    </p>
    <ZoomableImage src="https://files.liara.ir/liara/docs/see-static-ip-info.png" />

    <h3>آی‌پی ثابت اشتراکی</h3>
    <p align="justify">
      توجه داشته باشید IP که در اختیار شما قرار گرفته، ممکن است به چندین
      برنامه‌ی دیگر هم در لیارا اختصاص داده شده باشد. یعنی آی‌پی ثابتی که لیارا
      به شما می‌دهد اشتراکی است و مانند VPS ها اختصاصی نیست. این مورد مشکل خاصی
      برای‌تان ایجاد نمی‌کند و می‌توانید با خیال راحت آن را به بانک یا سرویس
      مورد نظرتان بدهید.
    </p>
  </Layout>
);
