import Head from "next/head";
import Layout from "../../components/Layout";

export default () => (
  <Layout>
    <Head>
      <title>مستندات رجیستری خصوصی - سرویس ابری لیارا</title>
    </Head>

    <h1>رجیستری خصوصی</h1>
    <span className="page-description">(Private Registry)</span>

    <p>
      در لیارا به هر حساب کاربری، یک رجیستری خصوصی اختصاص داده شده و سورس‌کد
      برنامه‌های شما به‌صورت یک ایمیج در این رجیستری خصوصی نگهداری می‌شود. به
      این شکل می‌توانید نسخه‌های مختلف را به‌راحتی از بخش{" "}
      <strong>تاریخچه</strong> برنامه‌هایتان مدیریت کرده و در زمان به‌وجود آمدن
      مشکل در نسخه‌های جدید، در سریع‌ترین زمان ممکن و با استفاده از قابلیت{" "}
      <strong>بازگرداندن</strong> یکی از نسخه‌های قبل برنامه را اجرا کنید.
    </p>
  </Layout>
);
