import Layout from '../../components/Layout'
import ZoomableImage from '../../components/ZoomableImage'
import Head from 'next/head'
import Notice from '../../components/Notice'

export default () => (
  <Layout>
    <Head>
      <title>Liara | متغیرها - Environment Variables</title>
    </Head>

    <h1>آی‌پی ثابت (Fixed / Static IP)</h1>
    <p>
      در یک سرویس ابری مانند لیارا، تعداد زیادی سرور به یکدیگر متصل شده و پروژه‌های شما در آن‌ها اجرا می‌شوند.
      لیارا با توجه به ظرفیت موجود در هر سرور تصمیم می‌گیرد که بهترین سرور برای اجرای پروژه‌ی شما کدام است و در نهایت پروژه‌ی شما را در آن اجرا می‌کند.
      در صورتی که پروژه‌ی‌تان را ری‌استارت کنید و یا عملیات استقرار جدیدی انجام دهید، لیارا ممکن است پروژه‌ی شما را به سرور دیگری که ظرفیت بیشتری دارد
      منتقل کرده و در آنجا اجرا کند.
    </p>

    <p>
      همه‌ی این‌ها به این معنی است که هیچ تضمینی وجود ندارد که پروژه‌ی شما همیشه دارای یک آی‌پی مشخص باشد. این ویژگی
      به ذات بد نیست بلکه باعث می‌شود شما بتوانید از انعطاف‌پذیری و مقیاس‌پذیری سرویس ابری لیارا نهایت استفاده را داشته باشید.
      <br />
      اما گاها پیش می‌آید که شما نیاز دارید که پروژه‌ی‌تان حتما در یک آی‌پی مشخص و ثابت اجرا شود و تغییر نکند. برای مثال،
      بعضی بانک‌ها انتظار دارند که آی‌پی پروژه‌ی‌تان را به آن‌ها بدهید تا درگاه پرداخت را برای‌تان فعال کنند.
    </p>

    <Notice>
      توجه داشته باشید که اگر از
      {' '}
      <b>زرین‌پال</b>
      {' '}
      برای درگاه پرداخت آنلاین استفاده می‌کنید، نیازی به آی‌پی ثابت ندارید.
    </Notice>

    <p>
      لیارا این امکان را برای‌تان فراهم کرده که هر زمان که نیاز داشتید بتوانید با یک کلیک
      آی‌پی ثابت اشتراکی برای پروژه‌ی‌تان تهیه کنید. در این صورت تمام درخواست‌های خروجی شما با یک آی‌پی مشخص خواهد بود.
      برای فعال‌سازی این قابلیت به صفحه‌ی تنظیمات پروژه مراجعه کرده و روی فعال‌سازی آی‌پی ثابت کلیک کنید.
    </p>

    <ZoomableImage src="/static/fixed-ip.png" alt="آی‌پی ثابت" />

    <h3>آی‌پی ثابت اشتراکی</h3>
    <p>
      توجه داشته باشید که IP ای که در اختیار شما قرار گرفته، ممکن است به چندین پروژه‌ی دیگر هم در لیارا اختصاص داده شده باشد.
      یعنی آی‌پی ثابتی که لیارا به شما می‌دهد اشتراکی است و مانند VPS ها اختصاصی نیست.
      این مورد مشکل خاصی برای‌تان ایجاد نمی‌کند و می‌توانید با خیال راحت آن را به بانک یا سرویس مورد نظرتان بدهید.
    </p>
    <p>
      اگر IP ثابت را فعال نکنید، همچنان پروژه‌ی شما دارای IP های اشتراکی خواهد بود.
      فعال‌کردن این قابلیت تنها تضمین می‌کند که پروژه‌ی شما دارای آی‌پی اشتراکی مشخص و ثابت خواهد بود و به این معنا نیست که یک آی‌پی اختصاصی برای شما تهیه خواهد شد.
    </p>
  </Layout>
)
