import Layout from "../../../components/Layout";
import Head from "next/head";
import ZoomableImage from "../../../components/ZoomableImage";

export default () => (
  <Layout>
    <Head>
      <title>سرویس ابری لیارا | مستندات دیسک‌ها</title>
    </Head>

    <h1>دیسک‌ها</h1>
    <span className="pageDescription">(Disks)</span>

    <h3>تهیه‌ی فایل پشتیبان از دیسک‌ها</h3>
    <p>
      لیارا این امکان را به شما می‌دهد که بتوانید به راحتی از پوشه‌ها و فایل‌های
      موجود در هر دیسک فایل پشتیبان تهیه کنید. عملیات پشتیبان‌گیری خودکار به
      صورت روزانه، هفتگی و ماهانه انجام می‌شود و در عین حال شما می‌توانید هر زمان
      که خواستید به صورت دستی نیز فایل پشتیبان تهیه کنید.
      <ZoomableImage
        src="/static/disks/backup.png"
        alt="صفحه‌ی پشتیبان‌گیری دیسک"
      />
    </p>

    <h3>برگرداندن اطلاعات از طریق فایل پشتیبان</h3>
    <p>
      اگر به هر دلیلی، اطلاعات دیسک شما دچار مشکل شد و بخشی از آن یا همه آن پاک
      شد یا فایل‌ها دچار خرابی شدند، لازم نیست نگران باشید. لیارا به وسیله
      فرآیند‌های پشتیبان‌گیری روزانه به شما این امکان را می‌دهد تا از آخرین
      اطلاعات فایل پشتیبان‌ استفاده کنید و بخش خیلی زیادی از اطلاعات خود را
      مجددا برگردانید. در صورت رخ دادن این اتفاق کافیست ابتدا آخرین فایل
      پشتیبان‌ را دانلود کنید و محتویات آن را به وسیله FTP به دیسک خود منتقل
      کنید تا بدین‌وسیله بخش زیادی از اطلاعات شما مجددا برگردد.
    </p>
    <ZoomableImage
      src="/static/disks/restore.png"
      alt="صفحه‌ی دانلود فایل پشتیبان دیسک"
    />
  </Layout>
);
