import Layout from "../../components/Layout";
import Head from "next/head";
import Link from "next/link";
import Highlight from "react-highlight";
import Notice from "../../components/Notice";
import ZoomableImage from "../../components/ZoomableImage";

export default () => (
  <Layout>
    <Head>
      <title>سرویس ابری لیارا | مستندات دیسک‌ها</title>
    </Head>

    <h1>دیسک‌ها</h1>
    <span className="pageDescription">(Disks)</span>

    <h3>درباره دیسک‌ها</h3>

    <Notice variant="warning">
      توجه کنید که اگر قبلا از قابلیت
      <span className="code">volume</span>
      استفاده می‌کردید، این قابلیت منسوخ شده و به دیسک تغییر نام داده شده‌است.
      اما شما می‌توانید بدون نیاز به اقدامی، همچنان از همان قابلیت استفاده کنید.
      <br />
      برای مهاجرت از
      <span className="code">volume</span>
      به دیسک‌ها، <Link href="#migrate">این بخش را مطالعه کنید.</Link>
    </Notice>

    <p>
      فایل‌سیستم در لیارا به خاطر معماری ابری آن زودگذر و فانی است، این یعنی هر
      فایلی که در کنار پوشه‌های برنامه‌های‌تان ذخیره کنید، بعد از یک عملیات
      استقرار و یا یک ری‌استارت، از بین خواهند رفت. لیارا امکانی با عنوان «دیسک»
      دارد که می‌تواند فایل‌های درون پوشه‌هایی که شما آن‌ها را مشخص می‌کنید را
      نگه‌داری کند. داده‌هایی که داخل دیسک‌ها نگه‌داری می‌شوند، بعد از یک عملیات
      استقرار و یا ری‌استارت، محفوظ می‌مانند.
    </p>
    <p>
      برای مثال ممکن است یک پوشه با نام
      <span className="code">uploads</span>
      داشته باشید که می‌توانید آن را به عنوان دیسک تعریف کرده و دیگر نگران از
      بین رفتن فایل‌های درون این پوشه نباشید. در برنامه‌هایی که از Laravel به
      عنوان فریم‌ورک اصلی استفاده می‌کنید، ممکن است که پوشه‌ی
      <span className="code">storage</span>
      را به عنوان دیسک تعریف کنید. به همین ترتیب، در برنامه‌های جنگو پوشه‌ی
      <span className="code">media</span>
      را و متناسب با ساختار برنامه‌ی‌تان، پوشه(های) دلخواه‌تان را به یک دیسک
      متصل کنید.
    </p>

    <Notice variant="info">
      برای استفاده از این قابلیت، Liara CLI باید دارای نسخه‌ی 2.4.0 یا بالاتر
      باشد. <Link href="/clients/cli#upgrade">راهنمای ارتقا CLI</Link>
    </Notice>

    <h2>مدیریت دیسک‌ها</h2>
    <h3>ساخت دیسک</h3>
    <p>
      برای این که بتوانید مسیر یک پوشه را به عنوان دیسک تعریف کنید، ابتدا لازم
      است که دیسک را با اندازه‌ی دلخواه‌تان از صفحه‌ی «دیسک‌ها» بسازید. اگر برای
      اولین‌بار وارد صفحه‌ی دیسک‌ها شوید، با چنین صفحه‌ای رو به رو می‌شوید:
    </p>
    <ZoomableImage src="/static/disks/1.png" alt="صفحه‌ی خالی دیسک‌ها" />

    <p>با کلیک روی دکمه‌ی «ساخت دیسک» می‌توانید اولین دیسک‌تان را بسازید.</p>
    <ZoomableImage src="/static/disks/2.png" alt="صفحه‌ی ساخت دیسک" />

    <p>
      همان‌طور که مشاهده می‌کنید، نام دیسک را در تصویر برابر با
      <span className="code">disk1</span>
      قرار داده‌ایم و اندازه‌ی آن را ۲ گیگابایت وارد کرده‌ایم. با کلیک روی
      دکمه‌ی «ساخت دیسک»، دیسک ساخته می‌شود و در صفحه‌ی دیسک‌ها قابل مشاهده است.
    </p>
    <ZoomableImage src="/static/disks/3.png" alt="صفحه‌ی دیسک‌ها" />

    <Notice variant="info">
      توجه کنید که این دیسک در وضعیت «آماده به کار» قرار دارد و باید مسیر آن را
      از طریق فایل liara.json تعریف کنید تا به وضعیت «در حال استفاده» تغییر کند.
      در ادامه نحوه‌ی تعریف دیسک توضیح داده می‌شود.
    </Notice>

    <p>
      به این نکته هم توجه داشته باشید که اگر دوباره به صفحه‌ی ساخت دیسک برگردیم،
      می‌توانیم دیسک‌های بیشتری را بسازیم. اما از آنجایی که قبلا دیسکی را
      ساخته‌ایم، الان فضای کمتری را برای ساخت دیسک خواهیم داشت که در تصویر زیر
      مشخص است. این فضا کاملا وابسته به پلن انتخابی شما برای برنامه‌تان است.
    </p>
    <ZoomableImage src="/static/disks/4.png" alt="صفحه‌ی ساخت دیسک" />

    <h3>تعریف مسیر دیسک</h3>
    <p>
      تعریف‌کردن مسیر دیسک به کمک فایل{" "}
      <Link href="/clients/cli#liara-json-file" title="مستندات CLI">
        liara.json
      </Link>{" "}
      صورت می‌گیرد.
    </p>
    <Highlight className="json">
      {`{
  "disks": [
    {
      "name": "disk1",
      "mountTo": "uploads"
    }
  ]
}
`}
    </Highlight>
    <p>
      فیلد <span className="code">name</span>
      در واقع همان نام دیسکی است که ساخته‌اید. فیلد
      <span className="code">mountTo</span>
      هم مسیر پوشه‌ای است که قصد دارید دیسک در آنجا قرار بگیرد و اصطلاحا mount
      شود. همان‌طور که در این نمونه مشاهده می‌کنید، این مسیر به صورت نسبی وارد
      شده است. در صورت تمایل، به صورت مطلق و از ریشه‌ی برنامه هم می‌توانید
      آدرس‌دهی کنید. البته آدرس‌دهی مطلق را توصیه نمی‌کنیم.
    </p>
    <p>
      به عنوان مثالی دیگر، فرض کنید برای یک برنامه‌ی لاراولی قصد دارید که یک
      دیسک برای پوشه‌ی storage بسازید. در این صورت، از بخش دیسک‌ها یک دیسک با
      نام دلخواه مانند
      <span className="code">mydisk</span>
      بسازید و بعد تنظیمات زیر را داخل فایل
      <span className="code">liara.json</span>
      قرار داده و دیپلوی کنید:
    </p>
    <Highlight className="json">
      {`{
  "disks": [
    {
      "name": "mydisk",
      "mountTo": "storage"
    }
  ]
}
`}
    </Highlight>

    <h3>تعریف چندین دیسک</h3>
    <p>
      در حالتی که ۲ یا چندین دیسک دارید، می‌توانید آن‌ها را مانند نمونه‌ی زیر
      تعریف کنید:
    </p>
    <Highlight className="json">
      {`{
  "disks": [
    {
      "name": "disk1",
      "mountTo": "public/files"
    },
    {
      "name": "disk2",
      "mountTo": "storage/images"
    }
  ]
}
`}
    </Highlight>

    <h3>حذف‌ دیسک‌ها</h3>
    <p>
      با حذف دیسک‌ها در لیارا داده‌های مربوط به آن دیسک کاملا حذف شده و غیرقابل
      بازگشت هستند. قبل از حذف دیسک اطمینان حاصل کنید که دیسک درستی را حذف
      میکنید. همچنین اگر دیسکی در حال استفاده باشد امکان حذف آن نیست و باید حتما
      دیسک را از برنامه جدا کنید تا امکان حذف آن وجود داشته باشد. برای جدا کردن
      دیسک از برنامه کافیست در فایل <span className="code">liara.json</span>{" "}
      دیسک مربوطه را حذف نمایید.
      <Highlight className="json">
        {`{
  "disks": [
  ]
}
`}
      </Highlight>
      برای حذف دیسک کافیست از طریق پنل دیسک‌ها گزینه <b>حذف دیسک</b> را انتخاب
      کنیم:
    </p>
    <ZoomableImage src="/static/disks/remove.png" alt="صفحه‌ی حذف دیسک" />

    <h3>افزایش حجم دیسک‌ها</h3>
    <p>
      در لیارا به سادگی میتوانید حجم دیسک‌های موجود را افزایش داده. فرض کنید پلن
      برنامه شما دارای <span className="code">5 GB</span> فضا میباشد. و شما یک
      دیسک به اندازه <span className="code">3 GB</span> ایجاد کرده اید. دیسک شما
      در حال پر شدن است. به سادگی از طریق پنل دیسک‌های لیارا میتوانید حجم دیسک
      خود را افزایش دهید. ابتدا باید برنامه خود را خاموش کنید. سپس از طریق بخش{" "}
      <b>تغییر اندازه</b> میتوانید حجم دلخواه خود را وارد کنید. در لیارا شما فقط
      امکان افزایش حجم را دارید درنتیجه باید حجم جدید بیشتر از حجم فعلی‌تان
      باشد.
      <ZoomableImage
        src="/static/disks/scale.png"
        alt="صفحه‌ی افزایش حجم دیسک"
      />
      <Notice variant="info">
        برای مثال همان‌طور که در تصویر بالا مشخص است فضای کل دیسک ما{" "}
        <span className="code">40 GB</span> میباشد که{" "}
        <span className="code">10 GB</span> آن در حال حاضر رزرو شده است، و ما
        میتوانیم حجم جدید را بیشتر از <span className="code">10 GB</span> تا{" "}
        <span className="code">30 GB</span> قرار دهیم.
      </Notice>
    </p>

    <h3>تهیه‌ی فایل پشتیبان از دیسک‌ها</h3>
    <p>
      لیارا این امکان را به شما میدهد که بتوانید به راحتی از پوشه‌ها و فایل‌های
      موجود در هر دیسک فایل پشتیبان تهیه کنید. عملیات پشتیبان‌گیری خودکار به
      صورت روزانه، هفتگی و ماهانه انجام میشود و در عین حال شما میتوانید هر زمان
      که خواستید به صورت دستی نیز فایل پشتیبان تهیه کنید.
      <ZoomableImage
        src="/static/disks/backup.png"
        alt="صفحه‌ی پشتیبان‌گیری دیسک"
      />
    </p>

    <h3>برگرداندن اطلاعات از طریق فایل پشتیبان</h3>
    <p>
      اگر به هر دلیلی، اطلاعات دیسک شما دچار مشکل شد و بخشی از آن یا همه آن پاک
      شد یا فایل‌ها دچار خرابی شدند، لازم نیست نگران باشید. لیارا به وسیله
      فرآیند‌های پشتیبان‌گیری روزانه به شما این امکان را میدهد تا از آخرین
      اطلاعات فایل پشتیبان‌ استفاده کنید و بخش خیلی زیادی از اطلاعات خود را
      مجددا برگردانید. در صورت رخ دادن این اتفاق کافیست ابتدا آخرین فایل
      پشتیبان‌ را دانلود کنید و محتویان آن را به وسیله FTP به دیسک خود منتقل
      کنید تا بدین‌وسیله بخش زیادی از اطلاعات شما مجددا برگردد.
    </p>
    <ZoomableImage
      src="/static/disks/restore.png"
      alt="صفحه‌ی دانلود فایل پشتیبان دیسک"
    />

    <h3>دسترسی به دیسک‌ها با FTP</h3>
    <p>
      برای مدیریت فایل‌ها و دایرکتوری‌های موجود در دیسک‌های پروژه‌تان، میتوانید
      از دسترسی FTP که لیارا در اختیار شما می‌گذارد استفاده کنید. همچنین این
      قابلیت را هم دارید که برای هر دیسک، حداکثر ۱۰ کاربر تعریف کنید تا هر کدام
      از اعضای تیم‌تان دسترسی منحصر به خودش را داشته باشد.
    </p>
    <h3>ایجاد دسترسی FTP</h3>
    <p>
      برای این کار ابتدا به بخش دیسک‌های پروژه‌تان در پنل بروید و روی دیسک
      مدنظرتان کلیک کنید. سپس وارد قسمت <b>دسترسی FTP</b> شوید. و در این صفحه بر
      روی دکمه ایجاد دسترسی FTP کلیک کنید:
    </p>
    <ZoomableImage src="/static/disk/ftp1.png" alt="صفحه‌ی خالی دسترسی FTP" />
    <p>در پنجره باز شده، نام کاربری مدنظرتان را وارد کنید:</p>
    <ZoomableImage src="/static/disk/ftp2.jpg" alt="صفحه‌ی ساخت دسترسی FTP" />
    <Notice variant="info">
      توجه داشته باشید که نام کاربری باید بین ۵ الی ۱۶ کاراکتر و تنها شامل حروف
      کوچک، عدد و ـ و همچنین یکتا باشد.
    </Notice>
    <p>
      پس از وارد کردن نام کاربری مدنظرتان در صورت در دسترس بودن نام کاربری بر
      روی دکمه ایجاد دسترسی کلیک کنید:
    </p>
    <ZoomableImage src="/static/disk/ftp3.jpg" alt="صفحه‌ی دسترسی‌ها ‌FTP" />
    <p>
      همان‌طور که مشاهده می‌کنید، دسترسی FTP با نام کاربری
      <span className="code">ftp_user</span>
      ایجاد شده است:
    </p>
    <ZoomableImage src="/static/disk/ftp4.png" alt="صفحه‌ی ساخت دیسک" />
    <Notice variant="info">
      با کلیک بر روی دکمه‌ی "ایجاد دسترسی FTP" می‌توانید دسترسی‌های بیشتری ایجاد
      کنید.
    </Notice>
    <h3>اتصال به دیسک</h3>
    <p>
      برای اتصال به دیسک از طریق FTP، می‌توانید از نرم‌افزار FileZilla و یا
      WinSCP استفاده کنید.
    </p>
    <h4>اتصال از طریق WinSCP</h4>
    <p>
      برای دانلود WinSCP می‌توانیداز لینک روبرو استفاده کنید:{" "}
      <a
        href="https://files.liara.ir/liara/WinSCP.5.17.5.Build.10414.zip"
        target="_blank"
      >
        دانلود WinSCP
      </a>{" "}
    </p>
    <p>
      بعد از دانلود و نصب WinSCP، هنگامی که نرم‌افزار را اجرا کنید با پنجره زیر
      روبرو خواهید شد که همانند تصویر نام کاربری، رمز عبور، هاست و پورتی که در
      صفحه‌ی دسترسی FTP در اختیارتان قرار گرفت را وارد کنید و متصل شوید:
    </p>
    <ZoomableImage
      src="/static/disk/winscp-1.jpg"
      alt="پنجره اتصال از طریق WinSCP"
    />
    <p>
      اگر اطلاعات را بدرستی وارد کرده باشید با پنجره‌ای همانند پنجره زیر روبرو
      خواهید شد:
    </p>
    <ZoomableImage
      src="/static/disk/winscp-2.jpg"
      alt="پنجره متصل به FTP در WinSCP"
    />
    <h4>اتصال از طریق FileZilla</h4>
    <p>
      برای دانلود FileZilla برای ویندوز، با توجه به معماری سیستم‌تان یکی از دو
      نسخه زیر را دانلود و نصب کنید:
    </p>

    <p>
      <a
        href="https://files.liara.ir/liara/FileZilla.3.48.1.x86.zip"
        target="_blank"
      >
        دانلود FileZilla برای ویندوز 32bit
      </a>
    </p>
    <p>
      <a
        href="https://files.liara.ir/liara/FileZilla.3.48.1.x64.zip"
        target="_blank"
      >
        دانلود FileZilla برای ویندوز 64bit
      </a>
    </p>

    <p>
      برای نصب FileZilla در لینوکس با توجه به توزیع لینوکس‌تان از یکی از
      دستورهای زیر استفاده کنید:
    </p>
    <p style={{ direction: "ltr" }}>
      Debian based:
      <span className="code">sudo apt install filezilla</span>
    </p>
    <p style={{ direction: "ltr" }}>
      RedHat based:
      <span className="code">sudo dnf install filezilla</span>
    </p>

    <p>
      بعد از دانلود و نصب FileZilla، در پنجره اصلی وارد بخش{" "}
      <span className="code">Site Manager</span> شوید:
    </p>
    <ZoomableImage
      src="/static/disk/filezilla-1.jpg"
      alt="بخش Site Manager در FileZilla"
    />

    <p>
      در پنجره باز شده، نام کاربری، رمز عبور، هاست و پورتی که در صفحه‌ی دسترسی
      FTP در اختیارتان قرار گرفت را وارد کنید:
    </p>
    <ZoomableImage
      src="/static/disk/filezilla-2.jpg"
      alt="تب General در Site Manager FileZilla"
    />

    <p>
      همچنین برای ارسال و دریافت دیتا نیاز داریم داریم تا{" "}
      <span className="code">Transfer mode</span>را در تب{" "}
      <span className="code">Transfer Settings</span> بر روی حالت{" "}
      <span className="code">Passive</span> قرار دهیم:
    </p>
    <ZoomableImage
      src="/static/disk/filezilla-3.jpg"
      alt="بخش Transfer Settings در FileZilla"
    />
    <p>
      بعد از این تنظیمات بر روی دکمه connect کلیک کنید تا به دیسک‌تان متصل
      بشوید. اگر اطلاعات و تنظیمات را به درستی تنظیم کرده باشید با پنجره‌ای
      همانند پنجره زیر روبرو خواهید شد:
    </p>
    <ZoomableImage
      src="/static/disk/filezilla-4.jpg"
      alt="پنجره متصل به FTP در FileZilla"
    />

    <br></br>
    <Notice variant="info">
      توجه کنید اگر دسترسی‌ای را پاک کنید اتصال کاربری که از طریق آن دسترسی متصل
      شده است قطع نمی‌شود.
    </Notice>
    <a name="migrate" />
    <h3>
      مهاجرت از <span className="code">volume</span> به{" "}
      <span className="code">disks</span>
    </h3>
    <Notice variant="warning">
      نیازی به مطالعه‌ی این قسمت نیست، اگر قبلا از قابلیت
      <span className="code">volume</span>
      استفاده نمی‌کردید.
    </Notice>
    <p>
      همان‌طور که پیش‌تر گفته شد، قابلیت
      <span className="code">volume</span>
      منسوخ شده و ممکن است بخواهید که به قابلیت جدید
      <span className="code">disks</span>
      مهاجرت کنید. خوشبختانه این کار بسیار ساده‌است. نمونه‌ی زیر را در نظر
      بگیرید:
      <Highlight className="json">
        {`{
  "volume": "/var/www/html/storage"
}
`}
      </Highlight>
      حالا برای انتقال این
      <span className="code">volume</span>، فقط کافیست که فایل{" "}
      <span className="code">liara.json</span>
      را به شکل زیر تغییر دهید:
    </p>
    <Highlight className="json">
      {`{
  "disks": [
    {
      "name": "default",
      "mountTo": "/var/www/html/storage"
    }
  ]
}
`}
    </Highlight>
    <p>
      در این حالت، نام دیسک را حتما باید
      <span className="code">default</span>
      وارد کنید. حالا می‌توانید دستور
      <span className="code">liara deploy</span>
      را اجرا کنید. در این مرحله، دیگر هشدار منسوخ‌شدن قابلیت
      <span className="code">volume</span>
      را مشاهده نخواهید کرد.
    </p>
  </Layout>
);
