import Layout from "../../../components/Layout";
import Head from "next/head";

export default () => (
  <Layout>
    <Head>
      <title>مستندات کاهش حجم دیسک‌ها - لیارا</title>
    </Head>

    <h1>دیسک‌ها</h1>
    <span className="page-description">(Disks)</span>

    <h3>کاهش حجم دیسک‌ها</h3>
    <p>
      در حالت‌های مختلفی ممکن است تصمیم بگیرید که اندازه‌ی دیسکی را کاهش دهید.
      اما با ورود به‌صفحه‌ی تغییر اندازه متوجه خواهید شد که تنها امکان افزایش
      اندازه‌ی دیسک وجود دارد و برای کاهش با خطا مواجه خواهید شد. از لحاظ فنی،
      این محدودیت برای افزایش امنیت فایل‌های شما و جلوگیری از احتمال از دست‌رفتن
      داده‌ها طی فرایند کاهش حجم اعمال شده‌است.
    </p>
    <p>
      اما فرض کنید در پلنی قرار دارید که در این پلن
      <span className="code">20G</span>
      فضا قابل تهیه‌کردن است و شما هم یک دیسک با اندازه‌ی
      <span className="code">20G</span>و با نام
      <span className="code">images</span>
      ساخته‌اید. بعد از مدتی، نیاز دارید که دیسک جدیدی برای نگه‌داری از لاگ‌هایی
      که داخل فایل ذخیره می‌کنید بسازید. دیسکی با نام{" "}
      <span className="code">logs</span>و با اندازه‌ی{" "}
      <span className="code">5GB</span>. در این شرایط، اگر وارد صفحه‌ی ایجاد
      دیسک شوید، می‌بینید که امکان ساخت دیسک جدیدی را ندارید چرا که از کل فضای
      پلن‌تان برای ساخت دیسک اول استفاده کرده‌اید.
    </p>

    <p>
      برای حل این مشکل، می‌توانید طبق مراحل زیر پیش بروید:
      <p>
        در صورتی که تمایلی به خواندن آموزش متنی ندارید می‌توانید ویدیوی آموزشی
        زیر ‌را مشاهده کنید.
      </p>
      <video
        src="https://files.liara.ir/liara/disks/reduce-disk-size.mp4"
        controls="controls"
        className="block w-full"
        width="100%"
      ></video>
      <ol>
        <li>
          ابتدا از صفحه‌ی تغییر اندازه‌ی برنامه، پلن انتخابی‌تان را به‌پلنی
          بالاتر برای مثال به‌پلن <span className="code">40G</span> ارتقا دهید.
        </li>
        <li>
          وارد صفحه‌ی دیسک‌ها شده و دیسکی با نام{" "}
          <span className="code">images2</span> و اندازه‌ی{" "}
          <span className="code">15G</span> و یا هر اندازه‌ای که مدنظرتان است
          بسازید.
        </li>
        <li>
          یک دیسک دیگر با نام <span className="code">logs</span> و اندازه‌ی{" "}
          <span className="code">5G</span> بسازید.
        </li>
        <li>
          حالا شما ۳ دیسک دارید. دیسک اول با نام{" "}
          <span className="code">images</span> و اندازه‌ی{" "}
          <span className="code">20G</span>، دیسک دوم با نام{" "}
          <span className="code">images2</span> و اندازه‌ی{" "}
          <span className="code">15G</span>و دیسک سوم با نام{" "}
          <span className="code">logs</span> و اندازه‌ی{" "}
          <span className="code">5G</span>
        </li>
        <li>
          حالا وارد سورس برنامه در کامپیوترتان شوید و فایل{" "}
          <span className="code">liara.json</span>
          ای که دارید را تغییر داده و نام دیسک‌های جدید را به‌جای دیسک قبلی وارد
          کنید و با دستور <span className="code">liara deploy</span>
          تغییرات‌تان را مستقر کنید.
        </li>
        <li>
          در صفحه‌ی دیسک‌ها باید وضعیت دو دیسک جدیدی که ساخته‌اید به‌حالت «در
          حال استفاده» تغییر کرده باشد و دیسک قدیمی‌ای که داشتید، باید به‌وضعیت
          «آماده به‌کار» تغییر کرده باشد.
        </li>
        <li>
          در این مرحله وارد صفحه‌ی پشتیبان‌گیری دیسک قدیمی یعنی{" "}
          <span className="code">images</span>
          شوید و فایل پشتیبان جدیدی تهیه کرده و یا یکی از فایل‌های پشتیبان فعلی
          را دانلود و محتویات آن را استخراج کنید. سپس یک دسترسی FTP برای دیسک{" "}
          <span className="code">images2</span>
          بسازید و فایل‌های‌تان را آپلود کنید.
        </li>
      </ol>
      اگر تمام مراحل بالا را بدون مشکلی طی کردید و حالا برنامه‌ی‌تان در وضعیتی
      که مدنظرتان است مستقر شده، می‌توانید دیسک اولی که داشتید یعنی{" "}
      <span className="code">images</span> را حذف کنید و حالا از صفحه‌ی تغییر
      اندازه‌ی برنامه، به‌پلن قبلی‌تان برگردید. توجه داشته باشید که تعرفه‌های
      لیارا ساعتی هستند و بنابراین، شما صرفا برای چند ساعتی که برنامه‌ی‌تان را
      به‌پلن بالاتر ارتقا داده بودید هزینه خواهید کرد.
    </p>
    <p>
      حالا سناریو دیگری را در نظر بگیرید. فرض کنیم در پلن
      <span className="code">20G</span>
      هستید و دیسکی هم با اندازه‌ی <span className="code">20G</span>
      ساخته‌اید اما بعد از مدتی، تصمیم گرفته‌اید که به‌پلن کوچک‌تری برای مثال
      پلن <span className="code">10G</span>
      بروید، چرا که مصرف برنامه‌ی‌تان بسیار پایین‌تر از پلن فعلی است.
    </p>
    <p>
      برای چنین حالتی هم می‌توانید طبق مراحل بالا پیش بروید. در واقع ابتدا
      پلن‌تان را ارتقا دهید تا فضای بیشتری در اختیار داشته باشید. سپس دیسک جدیدی
      با اندازه‌ی کمتری ساخته و آن را دیپلوی کنید. در نهایت محتویات دیسک قبلی را
      به‌دیسک جدید از طریق FTP آپلود کنید و سپس دیسک قبلی را حذف کنید. حالا شما
      یک دیسک جدید با اندازه‌ی فرضا
      <span className="code">10G</span>
      دارید و این امکان هم وجود دارد که از صفحه‌ی تغییر اندازه‌ی برنامه، به‌پلن
      <span className="code">10G</span>
      بروید.
    </p>
  </Layout>
);
