import Layout from '../../components/Layout'
import Head from 'next/head'
import Notice from '../../components/Notice'

export default () => (
  <Layout>
    <Head>
      <title>سرویس ابری لیارا | مستندات رابط خط فرمان - Liara CLI</title>
    </Head>

    <h1>رابط خط فرمان (CLI)</h1>

    <p>
      رابط خط فرمان و یا همان CLI لیارا، این امکان را به شما می‌دهد که فقط با چند دستور ساده، اپلیکیشن خود را در بستر ابری ما مستقر کنید.
      اگر با محیط خط فرمان و ترمینال آشنایی ندارید، نگران نباشید. دستوراتی که برای کار با لیارا نیاز خواهید داشت، بسیار مختصر و کوتاه هستند و نیاز به دانش عمیقی ندارند.
    </p>
    
    <h3>نصب و راه‌اندازی</h3>
    <p>
      برای نصب، NodeJS و npm باید در کامپیوتر شما نصب شده‌باشند. پیشنهاد ما نسخه‌ی ۸ به بعد NodeJS است.
      <br/>
      برای دانلود و نصب NodeJS می‌توانید از لینک مقابل استفاده کنید:
      {' '}
      <a href="https://nodejs.org/en/">وب‌سایت رسمی NodeJS</a>
    </p>
    <p>
      بعد از نصب NodeJS، با استفاده از دستور زیر، CLI بر روی کامپیوتر شما نصب می‌گردد:
    </p>
    <pre>
      <code>
        npm install -g @liara/cli
      </code>
    </pre>

    <a name="upgrade"></a>
    <h3>ارتقا به نسخه‌ی جدیدتر</h3>
    <p>
      اگر Liara cli
      را قبلا نصب کرده‌اید و الان صرفا قصد ارتقا آن را دارید، با استفاده از دستور زیر
      می‌توانید نسخه‌ی جدید را نصب کنید:
    </p>
    <pre>
      <code>
        npm install -g @liara/cli
      </code>
    </pre>
    <p>
      و حالا با دستور زیر می‌توانید نسخه‌ی CLI جدید را چک کنید:
    </p>
    <pre>
      <code>
        liara -v
      </code>
    </pre>

    <h3>ورود به حساب کاربری</h3>
    <p>
      برای این‌که بتوانید از CLI استفاده کنید، لازم است که در ابتدا، با استفاده از اطلاعات حساب کاربری‌تان در لیارا، وارد شوید:
    </p>
    <pre>
      <code>
        liara login
      </code>
    </pre>
    <p>
      بعد از وارد کردن دستور بالا، باید ایمیل و رمز عبور کاربری که با آن در لیارا ثبت نام کرده‌اید را وارد کنید.
      <br/>
      اگر اطلاعات صحیح باشند، با موفقیت وارد خواهید شد و CLI قابل استفاده خواهد بود.
      <br/>
      اگر هنوز ثبت نام نکرده‌اید، می‌توانید از لینک رو به رو اقدام کنید:
      {' '}
      <a href="https://console.liara.ir/register">ثبت نام در لیارا</a>
    </p>

    <a name="trouble"></a>
    <h3>خطاهای رایج در اجرای Liara CLI</h3>
    <p>
      اگر بعد از نصب CLI،
      خطایی را مانند خطاهای زیر مشاهده کردید، این بخش را حتما مطالعه کنید.
      <ul>
        <li><span className="code">command not found</span></li>
        <li><span className="code">command is not recognized as an internal or external command</span></li>
      </ul>
      دلیل این خطاها معمولا این است که مسیر پکیج‌های <span className="code">npm</span>
      در متغیر <span className="code">PATH</span>
      سیستم عامل شما اضافه نشده است. این مشکل معمولا به دلیل نصب ناقص NodeJS رخ می‌دهد.
    </p>
    <p>
      اما جای نگرانی نیست، چرا که می‌توانید به شکل زیر دستورات Liara CLI
      را وارد کنید:
    </p>
    <pre>
      <code>
{`npx liara login
npx liara deploy`}
      </code>
    </pre>
    <p>
      و یا به این صورت امتحان کنید:
    </p>
    <pre>
      <code>
{`npx @liara/cli login
npx @liara/cli deploy`}
      </code>
    </pre>

    <a name="liara-json-file"></a>
    <h3>فایل liara.json</h3>
    <p>
      برای این‌که CLI بتواند برنامه‌ی شما را با موفقیت در بستر لیارا مستقر کند، نیاز دارد که اطلاعاتی از برنامه‌ی‌تان داشته‌باشد.
      شما می‌توانید با ایجاد یک فایل با نام <span className="code">liara.json</span> این اطلاعات را در اختیار CLI قرار بدهید.
      توجه داشته باشید که این فایل حتما باید در
      {' '}
      <b>ریشه‌ی برنامه‌ی‌تان</b>
      {' '}
      ساخته شود. برای مثال، در کنار فایل
      <span className="code">composer.json</span>
      و یا
      <span className="code">package.json</span>.
    </p>
    <h3>نمونه‌ای از فایل liara.json:</h3>
    <pre>
      <code>
{`{
  "platform": "node",
  "app": "my-app",
  "port": 3000
}`}
      </code>
    </pre>
    <p>
      همان‌طور که مشاهده می‌کنید، فیلد app 
      در این فایل، همان شناسه‌ی برنامه‌ای است که می‌خواهید روی آن دیپلوی کنید.
      در این نمونه، فرض شده‌است که برنامه با NodeJS نوشته شده‌است.
      به همین دلیل، برای اجرای این برنامه نیاز به پلتفرم
      <span className="code">node</span>
      وجود دارد.
      در حال حاضر، پلتفرم‌های زیر قابل استفاده هستند:
    </p>
    <div className="ltr">
      <ul>
        <li>node</li>
        <li>laravel</li>
        <li>react</li>
        <li>vue</li>
        <li>angular</li>
        <li>static</li>
        <li>wordpress</li>
        <li>docker</li>
      </ul>
    </div>
    <p>
      <b>نکته: </b>
      برای هر پلتفرم، تنظیمات جداگانه‌ای وجود دارد که در بخش مربوط به هر کدام، می‌توانید مشاهده کنید.
    </p>

    <h3>مستقر کردن برنامه‌ها</h3>
    <p>
      برای مستقر کردن یک برنامه، باید دایرکتوری فعلی‌تان را به پوشه‌ی مورد نظر تغییر داده و بعد دستور
      <span className="code">liara deploy</span>
      را وارد کنید.
    </p>
    <pre>
      <code>
{`$ cd projects/my-app
$ liara deploy
`}
      </code>
    </pre>

    <p>
      بدون تغییر دادن دایرکتوری فعلی هم می‌توانید با پاس دادن پارامتر
      <span className="code">--path</span>
      برنامه‌ی مورد نظرتان را روی سرورهای لیارا مستقر کنید.
    </p>
    <pre>
      <code>
      $  liara deploy --path projects/my-app
      </code>
    </pre>

    <p>
      بعد از این دستور، لیارا سعی می‌کند که نوع برنامه‌ی شما را تشخیص دهد تا بتواند بستر مناسب
      برای اجرای آن را فراهم کند. مثلا اگر برنامه‌ی شما با Laravel نوشته شده‌است،
      در ابتدا سعی می‌کند که تشخیص دهد برنامه‌ی شما یک برنامه‌ی لاراولی است و در مرحله‌ی بعد از
      طریق راه‌اندازی بستر مناسب برای اجرای لاراول مانند نصب کردن PHP و Apache
      برنامه‌ی شما را اجرا می‌کند.
    </p>

    <h3>عملیات استقرار بدون فایل liara.json:</h3>
    <p>
      <p>
        ایجاد فایل liara.json الزامی نیست. شما می‌تونید از طریق پرامترهایی مثل
        <span className="code">--app</span>
        و یا
        <span className="code">--port</span>
        برنامه و پورت مدنظرتان را مشخص کنید. در این صورت دیگر
        cli
        سوالی در این باره از شما نمی‌پرسد.
      </p>
      <pre>
        <code>
          $ liara deploy --app my-app --port 5000
        </code>
      </pre>
    </p>

    <h3>نمایش لاگ‌های برنامه بلافاصله بعد از اتمام استقرار</h3>
    <p>
      بعد از اجرای دستور
      <span className="code">liara deploy</span>،
      اگر عملیات با موفقیت به اتمام برسد، لیارا لاگ‌های برنامه‌ی‌تان را بلافاصله بعد از اتمام استقرار نمایش می‌دهد.
      با مشاهده‌ی لاگ‌ها می‌توانید مطمئن شوید که برنامه‌ی‌تان به درستی مستقر شده.
      اگر نیازی به این قابلیت نمی‌بینید و یا این که دستور liara deploy
      را در محیط CI / CD
      اجرا می‌کنید، می‌توانید با پارامتر
      <span className="code">--detach</span>
      این قابلیت را غیر فعال کنید.
    </p>
    <pre>
        <code>
          $ liara deploy --app my-blog --port 80 --detach
        </code>
      </pre>
      <Notice variant="info">
      توضیحات بیشتر درباره راه‌اندازی CI/CD بر روی پلتفرم لیارا:
      {' '}
      <a href="https://liara.ir/blog/cicd-example/">«راهنمای راه اندازی CD به کمک GitLab»</a>
    </Notice>
  </Layout>
)
