import Layout from '../../components/Layout'
import Link from 'next/link'

export default () => (
  <Layout>
    <h1>استقرار پروژه‌های Laravel</h1>
    <p>
      پروژه‌ی شما باید دارای فایل
      <span className="code">composer.json</span>
      باشد تا بتواند در لیارا مستقر شود.
      <br />
      در حال حاظر، لیارا از Larvel > 5.0 پشتیبانی می‌کند.
    </p>
    
    <h3>شروع عملیات استقرار</h3>
    <p>
      در ابتدا مطمئن شوید که
      <span className="code">@liara/cli</span>
      را روی کامپیوترتان نصب کرده‌اید.
      {' '}
      <Link href="/clients/cli" title="مستندات CLI">اطلاعات بیشتر</Link>
      <br/>
      سپس دستور زیر را داخل پروژه‌ی‌تان اجرا کنید:
    </p>
    <pre>
      <code>
        liara deploy
      </code>
    </pre>

    <h3>پکیج‌ها به صورت خودکار نصب می‌شوند</h3>
    <p>
      لیارا به صورت خودکار پکیج‌هایی که در فایل‌های
      <span className="code">composer.json</span>
      و
      <span className="code">package.json</span>
      لیست شده‌اند را برای شما نصب می‌کند.
      پس نیازی ندارید که به دنبال اجرای دستورات
      <span className="code">composer install</span>
      و یا
      <span className="code">npm install</span>
      باشید.
      از آن‌جایی که اجرای این دستورات زمان‌بر است، برای سرعت بیشتر، این دستورات را روی سرورهای قدرتمندمان اجرا می‌کنیم تا زمان زیادی را منتظر نمانید.
    </p>

    <h3>فایل‌های CSS و JS به صورت خودکار build می‌شوند</h3>
    <p>
      همان‌طور که اطلاع دارید، در پروژه‌های لاراولی با اجرای دستور
      <span className="code">npm run production</span>
      فایل‌های
      SASS
      به
      CSS
      تبدیل می‌شوند و همین‌طور کدهای جاوا اسکریپت
      ES6
      به بالا به 
      ES5
      تبدیل شده و
      یک‌پارچه می‌شوند.
      <br/>
      هر زمان که پروژه‌ی‌تان را روی لیارا مستقر می‌کنید، ما این دستور را برای‌تان اجرا می‌کنیم
      تا مطمئن شویم که فایل‌های CSS و JS
      شما به صورت صحیح در اختیار کاربران‌تان قرار گیرند.
    </p>

    <h3>اتصال به دیتابیس</h3>
    <p>
      شما می‌توانید از بخش «دیتابیس‌ها»، یک دیتابیس
      MySQL یا MongoDB
      ایجاد کنید.
      بعد از ایجاد دیتابیس، در لیست دیتابیس‌ها، روی دیتابیس موردنظرتان کلیک کنید تا
      اطلاعات اتصال به آن برای‌تان نمایش داده شود.
      <br/>

      هر پروژه‌ای یک بخش تنظیمات دارد که از طریق آن می‌توانید متغیرهای لازم را برای پروژه تعریف کنید.
      (<Link href="/projects/environment-variables" title="مستندات متغیرها">اطلاعات بیشتر</Link>)

      <br/>
      برای این‌که پروژه‌ی‌ شما بتواند به دیتابیسی که ساختید متصل شود، باید متغیرهای زیر را ایجاد کرده و مقدار دهی کنید:
    </p>
    <pre>
      <code>
{`DB_CONNECTION=mysql
DB_HOST=s1.liara.ir
DB_PORT=12345
DB_DATABASE=my_database
DB_USERNAME=root
DB_PASSWORD=123456`}
      </code>
    </pre>
    <p>
      توجه کنید که متغیرهای بالا، صرفا جهت نمونه آورده شده‌اند و شما باید مقادیر را با اطلاعات دیتابیسی که ساختید پر کنید.
      <br/>
      نکته‌ی دیگری که باید به آن توجه کنید این است که در مثال بالا، فرض بر این بوده است که شما به سرور دیتابیس‌تان متصل شده و یک دیتابیس با نام
      <span className="code">my_database</span>
      ساخته‌اید.
    </p>

    <h3>اجرای Migration ها</h3>
    <p>
      از آن‌جایی که کنترل تغییرات دیتابیس باید در اختیار خود شما باشد،
      ما migration ها را اجرا نمی‌کنیم و شما باید هر زمان که نیاز داشتید آن‌ها را اجرا کنید.
      <br/>
      برای اجرا
      migration
      ها، کافیست به کنسول پروژه‌ی‌تان متصل شوید
      (<Link href="/projects/console" title="مستندات کنسول">اطلاعات بیشتر درمورد کنسول</Link>)
      و دستور مربوطه را اجرا کنید:
    </p>
    <pre>
      <code>
        php artisan migrate
      </code>
    </pre>
  </Layout>
)