import Link from 'next/link'
import Layout from '../../components/Layout'
import ZoomableImage from '../../components/ZoomableImage'

export default () => (
  <Layout>
    <h1>سرویس ذخیره‌ی فایل (Object Storage)</h1>
    <p>
      لیارا یک فایل‌سیستم
      (file system)
      زودگذر در اختیار هر پروژه‌ای قرار می‌دهد.
      داده‌هایی که شما در پوشه‌های پروژه‌یتان ذخیره می‌کنید ممکن است بعد از هر بار
      {' '}
      خاموش و روشن شدن سرویس‌تان از بین بروند. اکثر سیستم‌هایی که بر مبنای
      container
      ها هستند، مانند
      Docker،
      به همین شیوه عمل می‌کنند.
    </p>
    <p>
      برای نگهداری از داده‌ی پویا می‌توانید از یکی از انواع دیتابیس‌هایی که لیارا در اختیارتان قرار می‌دهد،
      مانند
      MySQL
      و یا
      MongoDB
      استفاده کنید.
      برای نگهداری از داده‌های ثابت و
      static
      می‌توانید از سرویس ذخیره‌ی فایل لیارا استفاده کنید.
    </p>
    <p>
      این سرویس در دنیا با عنوان
      Object Storage
      شناخته شده‌است و به شما این امکان را می‌دهد که تصاویر، ویدیوها، موسیقی‌ها و... را در بستر ابری و نامحدود ذخیره کنید.
    </p>

    <h3>فعال‌کردن سرویس</h3>
    <p>
      از فهرست بالای صفحه روی «سرویس فایل» کلیک کنید.
    </p>
    <ZoomableImage src="/static/storage-activate.png" alt="فعال‌سازی سرویس فایل" />
    <p>
      در این صفحه باید یک شناسه یکتا (namespace) برای سرویس ذخیره‌ی فایل‌تان انتخاب کنید.
      <br />
      با استفاده از این شناسه می‌توانید به فایل‌هایی که آپلود می‌کنید دسترسی داشته باشید.
      برای مثال اگر یک فایل با عنوان
      <span className="code">book.jpeg</span>
      آپلود کنید، این فایل در مسیر زیر قابل دسترسی خواهد بود:
    </p>
    <pre>
      <code>
        {`https://liara.ir/storage/<your-namespace>/book.jpeg`}
      </code>
    </pre>
    <p>
      همان‌طور که مشاهده می‌کنید، ما از شناسه‌ی یکتا برای آدرس‌دهی به فایل‌های شما استفاده می‌کنیم.
    </p>

    <h3>آپلود، مشاهده، کپی و حذف فایل‌ها</h3>
    <p>
      برای این که بتوانید فایل‌هایتان را مدیریت کنید، لازم است که یکی از
      <span className="code">SDK</span>
      های لیارا را روی پروژه‌یتان نصب کرده و با استفاده از آن عملیات مورد نظرتان را انجام دهید.
      <br />
      در حال حاظر، برای
      NodeJS
      و
      Laravel
      می‌توانید از پکیج‌های رسمی ما استفاده کنید.
    </p>
    <ul>
      <li>
        <Link href="/storage/nodejs">مستندات NodeJS SDK</Link>
      </li>
      <li>
        <Link href="/storage/laravel">مستندات Laravel SDK</Link>
      </li>
    </ul>
  </Layout>
)