import Head from "next/head";
import Link from "next/link";
import Layout from "../components/Layout";
import Asciinema from "../components/Asciinema";
import ZoomableImage from "../components/ZoomableImage";

export default () => (
  <Layout>
    <Head>
      <title>مدیریت حساب‌های کاربری - لیارا</title>
    </Head>

    <h1>مدیریت حساب‌های کاربری</h1>
    <p>
      به‌عنوان یک توسعه‌دهنده دور از انتظار نیست که تصمیم داشته باشید محیط‌های
      کاری و پروژه‌های مختلف خود را به‌صورت جداگانه مدیریت کنید. حال تیم توسعه
      لیارا با افزودن برخی قابلیت‌های جدید امکان مدیریت چندین حساب کاربری مختلف
      را علاوه‌بر پنل کاربری، در <Link href="/cli/install">لیارا CLI</Link>{" "}
      فراهم کرده است.
    </p>
    <h4>فهرست عناوین</h4>
    <ul>
      <li>
        <Link href="#console">مدیریت حساب‌های کاربری در پنل کاربری</Link>
      </li>
      <li>
        <Link href="#cli">مدیریت حساب‌های کاربری در لیارا CLI</Link>
      </li>
    </ul>

    <h3 id="console">مدیریت حساب‌های کاربری در پنل کاربری</h3>
    <p>
      برای مدیریت چندین حساب مختلف در پنل کاربری لیارا می‌توانید پس از کلیک بر
      روی پروفایل فعلی خود، بر روی دکمه‌ی <strong>افزودن حساب کاربری</strong>{" "}
      کلیک کرده و حساب‌های دیگری را در کنار حساب فعلی اضافه کنید.
    </p>
    <ZoomableImage src="/static/managing-account.png" />

    <h3 id="cli">مدیریت حساب‌های کاربری در لیارا CLI</h3>
    <p>
      فرض را بر این بگیریم شما و شرکت‌تان حساب‌های کاربری مستقلی در لیارا داشته
      باشید. در قدم اول باید این حساب‌ها را به‌شکل زیر در لیارا CLI اضافه کنید:
    </p>
    <Asciinema id="453759" />
    <p>
      پس از افزودن حساب‌های کاربری باید به‌شکل زیر حساب کاربری مورد نظر را در
      زمان دیپلوی یا اجرای عملیات‌های دیگر انتخاب کنید:
    </p>
    <Asciinema id="453764" />
    <p>
      برای کسب اطلاعات بیشتر می‌توانید مستندات نحوه‌ی{" "}
      <Link href="/cli/account">مدیریت حساب‌های کاربری</Link> با استفاده از
      لیارا CLI را مطالعه کنید.
    </p>
  </Layout>
);
