import Layout from "../../components/Layout";
import Head from "next/head";
import Link from "next/link";
import Highlight from "react-highlight";

export default () => (
  <Layout>
    <Head>
      <title>درباره ذخیره‌سازی ابری - سرویس ابری لیارا</title>
    </Head>

    <h1>ذخیره‌سازی ابری</h1>

    <p>
      ذخیره‌سازی ابری لیارا یک سرویس Object storage سازگار با پروتکل S3 است و به
      شما امکان می‌دهد حجم زیادی از داده‌ها را ذخیره کرده و آن‌ها را به
      کاربران‌تان ارائه کنید.
    </p>

    <h3>مزایا و کاربردهای ذخیره‌سازی ابری</h3>

    <ol>
      <li>
        <strong>مدیریت آسان فایل‌ها</strong>: ذخیره‌سازی ابری لیارا یک API بسیار
        ساده و سازگار با پروتکل S3 را در اختیار شما قرار می‌دهد و می‌توانید با
        استفاده از AWS SDK، به‌راحتی در زبان‌ها و فریم‌ورک‌های مختلف
        برنامه‌نویسی، این سرویس را مدیریت کنید.
      </li>
      <li>
        <strong>افزایش مقیاس‌پذیری</strong>: با ذخیره‌ی فایل‌ها در فضای
        ذخیره‌سازی ابری، مقیاس‌پذیری برنامه‌‌تان افزایش پیدا می‌کند و HA خواهید
        داشت.
      </li>
      <li>
        <strong>عملکرد فوق‌العاده</strong>: ذخیره‌سازی ابری به‌صورت هدفمند برای
        ارائه و کار با فایل‌ها توسعه داده شده و می‌تواند از پس workloadهای بالا
        بر بیاید.
      </li>
      <li>
        <strong>نگهداری ایمن فایل‌ها</strong>: به‌راحتی و تنها با یک کلیک
        می‌توانید سطح دسترسی ذخیره‌سازی ابری را از حالت عمومی به خصوصی تغییر
        دهید.
      </li>
    </ol>

    <h3>نحوه‌ی مدیریت ذخیره‌سازی ابری</h3>

    <p>
      در لیارا می‌توانید با استفاده از{" "}
      <Link href="/buckets/console">رابط کاربری اختصاصی</Link> و یا با استفاده
      از <Link href="/buckets/aws-sdk">AWS SDK</Link>، ذخیره‌سازی ابری را مدیریت
      کنید.
    </p>
  </Layout>
);
